/************************************************
文件：buzz.c
用途：
注意：内部8M晶振
************************************************/
#include "config.h"
/*************************************************************************
** 函数名称:蜂鸣器初始化
** 功能描述:
** 输　入:
** 输出	 :
** 全局变量:
** 调用模块:
** 说明：
** 注意：
**************************************************************************/
void Buzz_init(void)
{
    BUZZ_DDR |= (1<<SPK);
    BUZZ_PORT &=~ (1<<SPK);
}
/*************************************************************************
** 函数名称:蜂鸣
** 功能描述:
** 输　入: H_time: 响的时间 L_time: 不响的时间
** 输出	 :
** 全局变量:
** 调用模块:
** 说明：
** 注意：
**************************************************************************/
void Beep(unsigned int H_time,unsigned int L_time)
{
    BUZZ_PORT |= (1<<SPK);
    delay_nms(H_time);
    BUZZ_PORT &=~ (1<<SPK);
    delay_nms(L_time);
}

/*************************************************************************
** 函数名称:生日快乐歌
** 功能描述:
** 输　入: H_time: 响的时间 L_time: 不响的时间
** 输出	 :
** 全局变量:
** 调用模块:
** 说明：
** 注意：
**************************************************************************/
//生日快乐歌的音符频率表，不同频率由不同的延时来决定


void Music_HappyBirthday()
{
    //生日快乐歌的音符频率表，不同频率由不同的延时来决定
    unsigned char SONG_TONE[]={212,212,190,212,159,169,212,212,190,212,142,159,
    212,212,106,126,159,169,190,119,119,126,159,142,159,0};

    //生日快乐歌节拍表，节拍决定每个音符的演奏长短
    unsigned char SONG_LONG[]={9,3,12,12,12,24,9,3,12,12,12,24, 
    9,3,12,12,12,12,12,9,3,12,12,12,24,0};
    unsigned char i=0,j,k;

    PORTA = 0xff;
    DDRA = 0xff;
    DDRE = 0xff;
    PORTE = 0xff;

    while(SONG_LONG[i]!=0 || SONG_TONE[i]!=0)
    {
        //播放各个音符，SONG_LONG 为拍子长度
        for(j=0;j<SONG_LONG[i]*100;j++)
        {
            PORTA = (PORTA == 0xff) ? 0x00 : 0xff;

            if(BUZZ_PORT & 0x10)
            {
                BUZZ_PORT &=~ (1<<SPK);
            }
			else
            {
                BUZZ_PORT |= (1<<SPK);
            }
            //SONG_TONE 延时表决定了每个音符的频率
            for(k=0; k< SONG_TONE[i] / 3; k++);
        }

        delay_nms(200);
		if(5 == i || 11 == i || 17 == i)
			delay_nms(200);

        i++;
    }
}